;; -*- no-byte-compile: t; -*-
;;; private/dired/packages.el

(package! dired-quick-sort)
(package! ivy-dired-history)
(package! dired-quick-sort)
(package! dired-filter)
(package! dired-subtree)
(package! dired-narrow)
(package! dired-sidebar)
(package! all-the-icons-dired)

